read_verilog /workspace/output/ibex_post_synth/policy0/ibex.v
read_verilog /workspace/integrations/ibex/synth/ibex_fpga_top.v
hierarchy -check -top pipesense_ibex_fpga_top
synth_ecp5 -top pipesense_ibex_fpga_top -json /workspace/output/ibex_post_synth/policy0/ibex_top.json
stat
